## ðŸŽ¨ Data Science

In this notebook we will be dealing with a popular customer churn dataset. The objective of this dataset is to learn the reasons or conditions under which customers exit a company. If a company has a high churn rate, then that's a sign it needs change.

In [1]:
import pandas as pd

# TODO [1]: Read 'churn.csv' into a DataFrame. 
df = pd.read_csv('churn.csv')
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [4]:
# TODO [2]: Keep only the numerical columns. Hint: df = df.drop(columns=['Col1', 'Col2',... ]) can be faster 
df = df.drop(columns=['Geography', 'Gender', 'Surname'])
df.head()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,619,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,608,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,502,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,699,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,850,43,2,125510.82,1,1,1,79084.10,0

In [ ]:
# TODO [3]: Check if there are any missing values and fill them with the mean if the column if there is
missing_values = df.isnull().sum()
print("Missing values per column:\n", missing_values)
df = df.fillna(df.mean())

Missing values per column:
 RowNumber          0
CustomerId         0
CreditScore        0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [ ]:
# TODO [4]: Check statistics for the table

In [ ]:
# TODO [5]: Get rows of highest salary and lowest salary in a new dataframe

In [ ]:
import matplotlib.pyplot as plt
import numpy as np

# TODO [6]: Create potentially meaningful plot for the dataset

# Create subplots
plt.style.use('dark_background')            
fig, axs = plt.subplots(2, 2, figsize=(12, 8), dpi=150)
# treat each axs just like plt

# TODO [6.1]: Plot a histogram
credit_score = None
axs[0, 0].hist(credit_score, bins=30, color='skyblue', edgecolor='black')
axs[0, 0].set_title('Histogram')
axs[0, 0].set_xlabel('Credit Score')
axs[0, 0].set_ylabel('Frequency')

# TODO [6.2]: Plot a scatter plot of CreditScore VS. Salary
# TODO [6.2.1]: Get credit score and salaries for exited customers and plot
score_exit = None
salary_exit = None
# small dots
axs[0, 1].scatter(score_exit, salary_exit, color='red', s=0.9)
# TODO [6.2.2]: Get credit score and salaries for non-exited customers and plot
score_nonexit = None
salary_nonexit =None
axs[0, 1].scatter(score_nonexit, salary_nonexit, color='blue', s=0.9)
axs[0, 1].set_title('Scatter Plot')
axs[0, 1].set_xlabel('Balance')
axs[0, 1].set_ylabel('Estimated Salary')

# TODO [6.3]: Plot a bar chart
age, balance = None, None
axs[1, 0].bar(age, balance)
axs[1, 0].set_title('Bar Chart')
axs[1, 0].set_xlabel('Age')
axs[1, 0].set_ylabel('Balance')

# TODO [6.4]: Plot a box plot for tenure
tenure = None
axs[1, 1].boxplot(tenure)
axs[1, 1].set_title('Box Plot')
axs[1, 1].set_xlabel('Tenure')
axs[1, 1].set_ylabel('Frequency')

# Adjust layout
plt.tight_layout()

# Show plot
plt.show()